XIVN1987/MCUCode/board_CH32V/CH32V407/src/CSL/Peripheral/ch32v4x7_can.c
    if((CAN_FLAG & CAN_FLAGS_ERRSR) != (uint32_t)RESET)
    {
        if((CANx->ERRSR & (CAN_FLAG & 0x000FFFFF)) != (uint32_t)RESET)
        {
            bitstatus = SET;
        }
        else
        {
            bitstatus = RESET;
        }
    }
    else if((CAN_FLAG & CAN_FLAGS_STATR) != (uint32_t)RESET)
    {
        if((CANx->STATR & (CAN_FLAG & 0x000FFFFF)) != (uint32_t)RESET)
        {
            bitstatus = SET;
        }
        else
        {
            bitstatus = RESET;
        }
    }
    else if((CAN_FLAG & CAN_FLAGS_TSTATR) != (uint32_t)RESET)
    {
        if((CANx->TSTATR & (CAN_FLAG & 0x000FFFFF)) != (uint32_t)RESET)
        {
            bitstatus = SET;
        }
        else
        {
            bitstatus = RESET;
        }
    }
    else if((CAN_FLAG & CAN_FLAGS_RFIFO0) != (uint32_t)RESET)
    {
        if((CANx->RFIFO0 & (CAN_FLAG & 0x000FFFFF)) != (uint32_t)RESET)
        {
            bitstatus = SET;
        }
        else
        {
            bitstatus = RESET;
        }
    }
    else
    {
        if((uint32_t)(CANx->RFIFO1 & (CAN_FLAG & 0x000FFFFF)) != (uint32_t)RESET)
        {
            bitstatus = SET;
        }
        else
        {
            bitstatus = RESET;
        }
    }

    return bitstatus;
}

/*********************************************************************
 * @fn      CAN_ClearFlag
 *
 * @brief   Clears the CAN's pending flags.
 *
 * @param   CANx - where x can be 1 to select the CAN peripheral.
 *          CAN_FLAG - specifies the flag to clear.
 *            CAN_FLAG_RQCP0.
 *            CAN_FLAG_RQCP1.
 *            CAN_FLAG_RQCP2.
 *            CAN_FLAG_FF1.
 *            CAN_FLAG_FOV1.
 *            CAN_FLAG_FF0.
 *            CAN_FLAG_FOV0.
 *            CAN_FLAG_WKU.
 *            CAN_FLAG_SLAK.
 *            CAN_FLAG_LEC.
 *
 * @return  none
 */
void CAN_ClearFlag(CAN_TypeDef *CANx, uint32_t CAN_FLAG)
{
    uint32_t flagtmp = 0;

    if(CAN_FLAG == CAN_FLAG_LEC)
    {
        CANx->ERRSR = (uint32_t)RESET;
    }
    else
    {
        flagtmp = CAN_FLAG & 0x000FFFFF;

        if((CAN_FLAG & CAN_FLAGS_RFIFO0) != (uint32_t)RESET)
        {
            CANx->RFIFO0 = (uint32_t)(flagtmp);
        }
        else if((CAN_FLAG & CAN_FLAGS_RFIFO1) != (uint32_t)RESET)
        {
            CANx->RFIFO1 = (uint32_t)(flagtmp);
        }
        else if((CAN_FLAG & CAN_FLAGS_TSTATR) != (uint32_t)RESET)
        {
            CANx->TSTATR = (uint32_t)(flagtmp);
        }
        else
        {
            CANx->STATR = (uint32_t)(flagtmp);
        }
    }
}

/*********************************************************************
 * @fn      CAN_GetITStatus
 *
 * @brief   Checks whether the specified CANx interrupt has occurred or not.
 *
 * @param   CANx - where x can be 1 to select the CAN peripheral.
 *          CAN_IT -  specifies the CAN interrupt source to check.
 *            CAN_IT_TME.
 *            CAN_IT_FMP0.
 *            CAN_IT_FF0.
 *            CAN_IT_FOV0.
 *            CAN_IT_FMP1.
 *            CAN_IT_FF1.
 *            CAN_IT_FOV1.
 *            CAN_IT_WKU.
 *            CAN_IT_SLK.
 *            CAN_IT_EWG.
 *            CAN_IT_EPV.
 *            CAN_IT_BOF.
 *            CAN_IT_LEC.
 *            CAN_IT_ERR.
 *
 * @return  ITStatus - SET or RESET.
 */
ITStatus CAN_GetITStatus(CAN_TypeDef *CANx, uint32_t CAN_IT)
{
    ITStatus itstatus = RESET;

    if((CANx->INTENR & CAN_IT) != RESET)
    {
        switch(CAN_IT)
        {
            case CAN_IT_TME:
                itstatus = CheckITStatus(CANx->TSTATR, CAN_TSTATR_RQCP0 | CAN_TSTATR_RQCP1 | CAN_TSTATR_RQCP2);
                break;

            case CAN_IT_FMP0:
                itstatus = CheckITStatus(CANx->RFIFO0, CAN_RFIFO0_FMP0);
                break;

            case CAN_IT_FF0:
                itstatus = CheckITStatus(CANx->RFIFO0, CAN_RFIFO0_FULL0);
                break;

            case CAN_IT_FOV0:
                itstatus = CheckITStatus(CANx->RFIFO0, CAN_RFIFO0_FOVR0);
                break;

            case CAN_IT_FMP1:
                itstatus = CheckITStatus(CANx->RFIFO1, CAN_RFIFO1_FMP1);
                break;

            case CAN_IT_FF1:
                itstatus = CheckITStatus(CANx->RFIFO1, CAN_RFIFO1_FULL1);
                break;

            case CAN_IT_FOV1:
                itstatus = CheckITStatus(CANx->RFIFO1, CAN_RFIFO1_FOVR1);
                break;

            case CAN_IT_WKU:
                itstatus = CheckITStatus(CANx->STATR, CAN_STATR_WKUI);
                break;

            case CAN_IT_SLK:
                itstatus = CheckITStatus(CANx->STATR, CAN_STATR_SLAKI);
                break;

            case CAN_IT_EWG:
                itstatus = CheckITStatus(CANx->ERRSR, CAN_ERRSR_EWGF);
                break;

            case CAN_IT_EPV:
                itstatus = CheckITStatus(CANx->ERRSR, CAN_ERRSR_EPVF);
                break;

            case CAN_IT_BOF:
                itstatus = CheckITStatus(CANx->ERRSR, CAN_ERRSR_BOFF);
                break;

            case CAN_IT_LEC:
                itstatus = CheckITStatus(CANx->ERRSR, CAN_ERRSR_LEC);
                break;

            case CAN_IT_ERR:
                itstatus = CheckITStatus(CANx->STATR, CAN_STATR_ERRI);
                break;

            default:
                itstatus = RESET;
                break;
        }
    }
    else
    {
        itstatus = RESET;
    }

    return itstatus;
}

/*********************************************************************
 * @fn      CAN_ClearITPendingBit
 *
 * @brief   Clears the CANx's interrupt pending bits.
 *
 * @param   CANx - where x can be 1 to select the CAN peripheral.
 *          CAN_IT - specifies the interrupt pending bit to clear.
 *            CAN_IT_TME.
 *            CAN_IT_FF0.
 *            CAN_IT_FOV0.
 *            CAN_IT_FF1.
 *            CAN_IT_FOV1.
 *            CAN_IT_WKU.
 *            CAN_IT_SLK.
 *            CAN_IT_EWG.
 *            CAN_IT_EPV.
 *            CAN_IT_BOF.
 *            CAN_IT_LEC.
 *            CAN_IT_ERR.
 *
 * @return  none
 */
void CAN_ClearITPendingBit(CAN_TypeDef *CANx, uint32_t CAN_IT)
{
    switch(CAN_IT)
    {
        case CAN_IT_TME:
            CANx->TSTATR = CAN_TSTATR_RQCP0 | CAN_TSTATR_RQCP1 | CAN_TSTATR_RQCP2;
            break;

