XIVN1987/MCUCode/board_CH32V/CH32V407/src/CSL/Peripheral/ch32v4x7_can.c
        case CAN_IT_FF0:
            CANx->RFIFO0 = CAN_RFIFO0_FULL0;
            break;

        case CAN_IT_FOV0:
            CANx->RFIFO0 = CAN_RFIFO0_FOVR0;
            break;

        case CAN_IT_FF1:
            CANx->RFIFO1 = CAN_RFIFO1_FULL1;
            break;

        case CAN_IT_FOV1:
            CANx->RFIFO1 = CAN_RFIFO1_FOVR1;
            break;

        case CAN_IT_WKU:
            CANx->STATR = CAN_STATR_WKUI;
            break;

        case CAN_IT_SLK:
            CANx->STATR = CAN_STATR_SLAKI;
            break;

        case CAN_IT_EWG:
            CANx->STATR = CAN_STATR_ERRI;
            break;

        case CAN_IT_EPV:
            CANx->STATR = CAN_STATR_ERRI;
            break;

        case CAN_IT_BOF:
            CANx->STATR = CAN_STATR_ERRI;
            break;

        case CAN_IT_LEC:
            CANx->ERRSR = RESET;
            CANx->STATR = CAN_STATR_ERRI;
            break;

        case CAN_IT_ERR:
            CANx->ERRSR = RESET;
            CANx->STATR = CAN_STATR_ERRI;
            break;

        default:
            break;
    }
}

/*********************************************************************
 * @fn      CheckITStatus
 *
 * @brief   Checks whether the CAN interrupt has occurred or not.
 *
 * @param   CAN_Reg - specifies the CAN interrupt register to check
 *          It_Bit - specifies the interrupt source bit to check.
 *
 * @return  ITStatus - SET or RESET.
 */
static ITStatus CheckITStatus(uint32_t CAN_Reg, uint32_t It_Bit)
{
    ITStatus pendingbitstatus = RESET;

    if((CAN_Reg & It_Bit) != (uint32_t)RESET)
    {
        pendingbitstatus = SET;
    }
    else
    {
        pendingbitstatus = RESET;
    }

    return pendingbitstatus;
}

/*********************************************************************
 * @fn      CAN_BusOff_ErrCntConfig
 *
 * @brief   Configures the CAN the number of err count bus off.
 *
 * @param   CANx - where x can be 1 to select the CAN peripheral.
 *          BusOff_ErrCnt - Err count bus off.
 *            This parameter must range from 0x00 to 0xFF.
 *
 * @return  none
 */
void CAN_BusOff_ErrCntConfig(CAN_TypeDef *CANx, uint8_t BusOff_ErrCnt)
{
    CANx->TERR_CNT &= ~(0x000000FF);
    CANx->TERR_CNT |= (uint32_t)BusOff_ErrCnt;
}
